app/controllers/songs_controller.rb

  def edit
    if params[:artist_id]
      if !Artist.exists?(params[:artist_id])
        redirect_to artists_path, alert: "Artist not found."
      else
        artist = Artist.find_by(:id => params[:artist_id])
        #why does this below method not work but the above does?
        artist = Artist.find_by(id: params[:id])
        @song = artist.songs.find_by(id: params[:id])
---
SELECT "artists".* FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]